# Data Visualization with Python

# This Script Contains:

1. Task 1-3 - Import Libraries & Data
2. Task 4 - Data Wrangling
3. Task 5 - Data Quality & Consistency Checks
4. Task 6 - Merge Data
5. Task 8 - Export Data

# Task 1-3 - Import Libraries & Data

In [27]:
# Import Libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [28]:
# Setting file path

path = r'C:\Users\cschw\OneDrive\Desktop\Achievement 4\Instacart Basket Analysis'

In [29]:
# Import customers.csv

cstmrs = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'))

In [30]:
# Check head

cstmrs.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [31]:
# Check dimensions

cstmrs.shape

(206209, 10)

In [32]:
# Descriptive Stats
cstmrs.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [33]:
# Check data types
cstmrs.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Task 4 - Data Wrangling

In [34]:
# Rename First Name to first_name to fit with other columns

cstmrs.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [35]:
# Change surnam column to corrrect spelling

cstmrs.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [36]:
# Fix capitalization
cstmrs.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [37]:
cstmrs.rename(columns = {'Age' : 'age'}, inplace = True)

In [38]:
cstmrs.rename(columns = {'STATE' : 'state'}, inplace = True)

In [39]:
# rename fam_status as marital_status

cstmrs.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [44]:
cstmrs.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [45]:
cstmrs.head(10)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

All columns have been appropriately renamed. The columns here all can be used in some way, so I am not dropping any of them yet.

# Task 5 - Data Quality & Consistency Checks

In [46]:
# check data types
cstmrs.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

user_id data type is int64 when it should be str

In [52]:
# Change user_id data type to str

cstmrs['user_id'] = cstmrs['user_id'].astype('str')

In [53]:
# check for mixed data types
for col in cstmrs.columns.tolist():
  weird = (cstmrs[[col]].map(type) != cstmrs[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cstmrs[weird]) > 0:
    print (col)

^ The first_name column has mixed data types

In [54]:
# Correcting data type in first_name column

cstmrs['first_name'] = cstmrs['first_name'].astype('str')

In [55]:
# Re check data types

cstmrs.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [57]:
# Check again for mixed data

for col in cstmrs.columns.tolist():
  weird = (cstmrs[[col]].map(type) != cstmrs[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cstmrs[weird]) > 0:
    print (col)

In [58]:
# Check for missing data

cstmrs.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [61]:
# Check for duplicates

cstmrs_dups = cstmrs[cstmrs.duplicated()]

In [62]:
cstmrs_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [63]:
# Descriptive Stats

cstmrs.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

# Task 06 - Merge Data

In [64]:
# Import orders_products_grouped.pkl to merge with cstmrs dataframe

ords_prods_grpd = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_grouped.pkl'))

In [65]:
# check shape of ords_prods_grpd

ords_prods_grpd.shape

(32404859, 25)

In [66]:
# check shape of cstmrs

cstmrs.shape

(206209, 10)

In [67]:
# Find shared column

ords_prods_grpd.head(5)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_product_price,spending_flag,median_days_between_orders,order_frequency
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Mid-range Product,Regularly busy,Regularly busy,Average Orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Mid-range Product,Regularly busy,Slowest days,Average Orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Mid-range Product,Regularly busy,Slowest days,Most Orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Mid-range Product,Least busy,Slowest days,Average Orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Mid-range Product,Least busy,Slowest days,Most Orders,10,New customer,6.367797,Low Spender,20.5,Non-frequent customer

In [69]:
# find shared column

cstmrs.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

'user_id' is a column in both dataframe, this can be the shared key

In [70]:
# check data type of user_id column in cstmrs

cstmrs.dtypes['user_id']

dtype('O')

In [71]:
ords_prods_grpd.dtypes['user_id']

dtype('int64')

In [74]:
# Change data type to match cstmrs df

ords_prods_grpd['user_id'] = ords_prods_grpd['user_id'].astype('str')

In [75]:
ords_prods_grpd.dtypes['user_id']

dtype('O')

In [76]:
cstmrs.dtypes['user_id']

dtype('O')

In [77]:
# check for columns to drop

ords_prods_grpd.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', '_merge', 'price_range_loc', 'busiest_day',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_product_price', 'spending_flag', 'median_days_between_orders',
       'order_frequency'],
      dtype='object')

In [78]:
# drop '_merge' column

ords_prods_grpd = ords_prods_grpd.drop(columns=['_merge'])

In [80]:
# Merge cstmrs with ords_prods_grpd on 'user_id'

custs_ords_prods = ords_prods_grpd.merge(cstmrs, on = 'user_id', indicator = True)

In [82]:
# check head of new df

custs_ords_prods.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [83]:
custs_ords_prods['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [84]:
# Check data type

custs_ords_prods.dtypes

order_id                         int64
user_id                         object
eval_set                        object
order_number                     int64
order_dow                        int64
order_hour_of_day                int64
days_since_prior_order         float64
product_id                       int64
add_to_cart_order                int64
reordered                        int64
product_name                    object
aisle_id                         int64
department_id                    int64
prices                         float64
price_range_loc                 object
busiest_day                     object
busiest_days                    object
busiest_period_of_day           object
max_order                        int64
loyalty_flag                    object
mean_product_price             float64
spending_flag                   object
median_days_between_orders     float64
order_frequency                 object
first_name                      object
surname                         object
gender                          object
state                           object
age                              int64
date_joined                     object
n_dependants                     int64
marital_status                  object
income                           int64
_merge                        category
dtype: object

In [85]:
# change order_id data type to str

custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

# Task 08 - Export

In [86]:
custs_ords_prods.to_pickle(os.path.join(path, 'Data','Prepared Data', 'orders_products_customers_merged.pkl'))